lab 2/stress_test_.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-52-70-225-223.compute-1.amazonaws.com (be patient)


Server Software:        PasteWSGIServer/0.5
Server Hostname:        ec2-52-70-225-223.compute-1.amazonaws.com
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1275 bytes

Concurrency Level:      50
Time taken for tests:   0.805 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      431100 bytes
HTML transferred:       382500 bytes
Requests per second:    372.73 [#/sec] (mean)
Time per request:       134.144 [ms] (mean)
Time per request:       2.683 [ms] (mean, across all concurrent requests)
Transfer rate:          523.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       27   46  11.0     42      78
Processing:    31   79  57.3     67     338
Waiting:       30   75  57.3     64     333
Total:         59  124  56.1    114     376

Percentage of the requests served within a certain time (ms)
  50%    114
  66%    122
  75%    125
  80%    128
  90%    133
  95%    152
  98%    367
  99%    372
 100%    376 (longest request)