lab 2/stress_test_100.25.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-52-55-236-247.compute-1.amazonaws.com (be patient).....done


Server Software:        PasteWSGIServer/0.5
Server Hostname:        ec2-52-55-236-247.compute-1.amazonaws.com
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1275 bytes

Concurrency Level:      25
Time taken for tests:   0.588 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      143700 bytes
HTML transferred:       127500 bytes
Requests per second:    169.94 [#/sec] (mean)
Time per request:       147.113 [ms] (mean)
Time per request:       5.885 [ms] (mean, across all concurrent requests)
Transfer rate:          238.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       31   35   2.9     34      48
Processing:    34   86 119.6     42     552
Waiting:       32   84 119.4     41     552
Total:         66  121 119.9     77     587

Percentage of the requests served within a certain time (ms)
  50%     77
  66%     87
  75%     89
  80%     91
  90%    328
  95%    345
  98%    587
  99%    587
 100%    587 (longest request)