lab 2/stress_test_100_1.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-52-55-236-247.compute-1.amazonaws.com (be patient).....done


Server Software:        PasteWSGIServer/0.5
Server Hostname:        ec2-52-55-236-247.compute-1.amazonaws.com
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1275 bytes

Concurrency Level:      1
Time taken for tests:   6.774 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      143700 bytes
HTML transferred:       127500 bytes
Requests per second:    14.76 [#/sec] (mean)
Time per request:       67.740 [ms] (mean)
Time per request:       67.740 [ms] (mean, across all concurrent requests)
Transfer rate:          20.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       31   32   1.3     31      39
Processing:    34   36   1.5     36      44
Waiting:       33   34   0.9     33      37
Total:         65   68   2.1     67      76
WARNING: The median and mean for the waiting time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     68
  75%     69
  80%     69
  90%     70
  95%     71
  98%     75
  99%     76
 100%     76 (longest request)