lab 2/stress_test_250_1.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-52-55-236-247.compute-1.amazonaws.com (be patient)


Server Software:        PasteWSGIServer/0.5
Server Hostname:        ec2-52-55-236-247.compute-1.amazonaws.com
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1275 bytes

Concurrency Level:      50
Time taken for tests:   1.106 seconds
Complete requests:      250
Failed requests:        0
Total transferred:      359250 bytes
HTML transferred:       318750 bytes
Requests per second:    226.06 [#/sec] (mean)
Time per request:       221.185 [ms] (mean)
Time per request:       4.424 [ms] (mean, across all concurrent requests)
Transfer rate:          317.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       31   40   7.0     38      72
Processing:    34  121 164.5     51    1061
Waiting:       33  119 164.4     48    1061
Total:         67  161 166.1     92    1104

Percentage of the requests served within a certain time (ms)
  50%     92
  66%    102
  75%    109
  80%    327
  90%    354
  95%    590
  98%    615
  99%    624
 100%   1104 (longest request)