lab 2/stress_test_300_75.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ec2-52-55-236-247.compute-1.amazonaws.com (be patient)


Server Software:        PasteWSGIServer/0.5
Server Hostname:        ec2-52-55-236-247.compute-1.amazonaws.com
Server Port:            80

Document Path:          /?keywords=helloworld+foo+bar
Document Length:        1275 bytes

Concurrency Level:      75
Time taken for tests:   14.877 seconds
Complete requests:      287
Failed requests:        0
Total transferred:      412419 bytes
HTML transferred:       365925 bytes
Requests per second:    19.29 [#/sec] (mean)
Time per request:       3887.621 [ms] (mean)
Time per request:       51.835 [ms] (mean, across all concurrent requests)
Transfer rate:          27.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       32   50  13.6     47      91
Processing:    36  150 227.0     67    1417
Waiting:       33  145 226.1     66    1417
Total:         73  200 225.2    125    1457

Percentage of the requests served within a certain time (ms)
  50%    125
  66%    134
  75%    146
  80%    176
  90%    381
  95%    612
  98%   1417
  99%   1421
 100%   1457 (longest request)